"use strict";

// Интересные задачки

// // 1. Какое будет выведено значение: let x = 5; alert( x++ ); ?
// let x1 = 5; 
// alert(x1++); // 5

// // 2. Чему равно такое выражение: [ ] + false - null + true ?
// console.log( [] + false ); // type = string, 'false'
// console.log( [] + false - null + true ); // NaN

// 3. Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
// let y = 1; 
// let x = y = 2; 
// alert(x); // 2

// 4. Чему равна сумма [ ] + 1 + 2?
// console.log([] + 1 + 2); // 12

// 5. Что выведет этот код: alert( "1"[0] )?
// alert( "12"[1] ); // 2

// 6. Чему равно 2 && 1 && null && 0 && undefined ?
// console.log(2 && 1 && null && 0 && undefined ); // null
// Оператор И запинается на лжи
// а ИЛИ - на правде


// 7. Есть ли разница между выражениями? !!( a && b ) и (a && b)?
// да, '!!' превращает в boolean

// 8. Что выведет этот код: alert( null || 2 && 3 || 4 ); ?
// alert( null || 2 && 3 || 4 ); // 3 - смотреть таблицу приоритетов операторов js


// 9. a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?    - нет


// Что выведет этот код: alert( +"Infinity" ); ?
alert( +"Infinity" );

// Верно ли сравнение: "Ёжик" > "яблоко"?


// Чему равно 0 || "" || 2 || undefined || true || falsе ?
